In [176]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Problem Statement:

In [177]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [178]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [179]:
df.isna().sum()

From_To         0
FlightNumber    2
RecentDelays    0
Airline         0
dtype: int64

In [180]:
df=df.reset_index()
df

   index           From_To  FlightNumber  RecentDelays              Airline
0      0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      1      MAdrid_miLAN           NaN            []    <Air France> (12)
2      2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3      3    Budapest_PaRis           NaN          [13]       12. Air France
4      4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Problem: 1
Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [181]:
for i in range(0,5):
    df['FlightNumber'][i+1]=df['FlightNumber'][i]+10
    print(df['FlightNumber'][i])

10045.0
10055.0
10065.0
10075.0
10085.0

<ipython-input-181-cb2c107525ac>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][i+1]=df['FlightNumber'][i]+10

In [182]:
df

   index           From_To  FlightNumber  RecentDelays              Airline
0      0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2      2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3      3    Budapest_PaRis       10075.0          [13]       12. Air France
4      4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [183]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [184]:
df

   index           From_To  FlightNumber  RecentDelays              Airline
0      0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      1      MAdrid_miLAN         10055            []    <Air France> (12)
2      2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3      3    Budapest_PaRis         10075          [13]       12. Air France
4      4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [185]:
df.dtypes

index            int64
From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

# Problem:2
The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [186]:
new=df['From_To'].str.split('_' ,expand=True )

In [187]:
df['From']=new[0]

In [188]:
df['To']=new[1]

In [189]:
df.drop(columns=['From_To'] ,axis=1, inplace=True)

In [190]:
df

   index  FlightNumber  RecentDelays              Airline      From         To
0      0         10045      [23, 47]               KLM(!)    LoNDon      paris
1      1         10055            []    <Air France> (12)    MAdrid      miLAN
2      2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3      3         10075          [13]       12. Air France  Budapest      PaRis
4      4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

# Problem:3
Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [191]:
df['From']=df['From'].str.capitalize()

In [192]:
df['To']=df['To'].str.capitalize()

In [193]:
df

   index  FlightNumber  RecentDelays              Airline      From         To
0      0         10045      [23, 47]               KLM(!)    London      Paris
1      1         10055            []    <Air France> (12)    Madrid      Milan
2      2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3      3         10075          [13]       12. Air France  Budapest      Paris
4      4         10085      [67, 32]          "Swiss Air"  Brussels     London

# Problem:4
4. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [196]:
df[['delay_1','delay_2','delay_3']]=pd.DataFrame(df.RecentDelays.tolist(), index= df.index)

In [200]:
df.drop(columns=['RecentDelays'],inplace=True)

In [201]:
df

,index,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN